Repository: nguyenvietcuong0112/vc02_astrology_ai
Catalog: lib/l10n/app_*.arb
Languages: vi

# appName
source: Astrology AI
vi: Chiêm Tinh AI

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

# homePageTitle
source: Your Personal Horoscope
vi: Lá Số Tử Vi Của Bạn

# homePageSubtitle
source: Enter your birth details to reveal your cosmic blueprint.
vi: Nhập thông tin ngày sinh để khám phá bản đồ sao của bạn.

source: Date of Birth
vi: Ngày sinh

source: Time of Birth
vi: Giờ sinh

# timeOfBirthHint
source: HH:MM (24-hour format)
vi: HH:MM (định dạng 24 giờ)

source: Place of Birth
vi: Nơi sinh

# placeOfBirthHint
source: City, Country
vi: Thành phố, Quốc gia

# getHoroscopeButton
source: Get Basic Horoscope
vi: Xem Tử Vi Cơ Bản

# getPremiumHoroscopeButton
source: Get Premium Horoscope
vi: Xem Tử Vi Cao Cấp

source: Horoscope Results
vi: Kết Quả Luận Giải

source: Personality
vi: Tính cách

source: Overview
vi: Tổng quan

source: Love
vi: Tình duyên

source: Career
vi: Sự nghiệp

source: Health
vi: Sức khỏe

source: Finance
vi: Tài chính

source: Advice
vi: Lời khuyên

source: Deeper Analysis
vi: Phân Tích Chuyên Sâu

# errorHistory
source: Error loading history
vi: Lỗi tải lịch sử

# noHistory
source: No history found. Get a new horoscope to see it here!
vi: Không có lịch sử. Hãy xem một lá số mới để thấy ở đây!

# birthInfoLabel
source: Birth Info
vi: Thông tin sinh

# atLabel
source: At
vi: Tại

# viewedOnLabel
source: Viewed on
vi: Xem lúc

# refreshHistory
source: Refresh
vi: Làm mới

# errorGeneral
source: An unknown error occurred.
vi: Đã xảy ra lỗi không xác định.

# errorMissingInput
source: Please fill in all birth details.
vi: Vui lòng điền đầy đủ thông tin ngày sinh.

# errorFetching
source: An error occurred while fetching the reading.
vi: Đã xảy ra lỗi khi lấy lá số.

source: Personal Notes
vi: Ghi Chú Cá Nhân

source: Edit Note
vi: Sửa Ghi Chú

# noteHint
source: Write your thoughts here...
vi: Viết suy nghĩ của bạn ở đây...

# saveButton
source: Save
vi: Lưu

# cancelButton
source: Cancel
vi: Hủy

# noNotesYet
source: No notes yet. Tap the edit icon to add one!
vi: Chưa có ghi chú. Chạm vào biểu tượng sửa để thêm!

source: Share Horoscope
vi: Chia sẻ lá số

# shareSubject
source: My Horoscope from Astrology AI!
vi: Lá số của tôi từ Chiêm Tinh AI!

# premiumUpgrade
source: This is a basic reading. For a deeper analysis including Health, get a Premium Horoscope!
vi: Đây là lá số cơ bản. Để xem phân tích chuyên sâu hơn bao gồm cả Sức khỏe, hãy chọn xem Tử Vi Cao Cấp!

# libraryTitle
source: Astrology Library
vi: Thư viện Chiêm tinh

# librarySubtitle
source: Explore the mystical terms of astrology. Tap a term to learn more.
vi: Khám phá các thuật ngữ thần bí của chiêm tinh học. Chạm vào một thuật ngữ để tìm hiểu thêm.

# compatibilityTitle
source: Zodiac Compatibility
vi: Kiểm Tra Độ Hợp Cung

# compatibilitySubtitle
source: See how well two signs match
vi: Xem hai cung hoàng đạo hợp nhau như thế nào

# checkButton
source: Check Compatibility
vi: Kiểm Tra Độ Hợp

# resultsTitle
source: Results
vi: Kết Quả

# scoreLabel
source: Score
vi: Điểm

# summaryLabel
source: Summary
vi: Tóm tắt

# adviceLabel
source: Advice
vi: Lời khuyên
